#include <stdio.h>
/****************************************************************
int main(void) {
    int *p;     //p是个变量名字，int * 表示该p变量只能存储int类型变量的地址
    int i = 10, j;
    //*p = i;
    p = &i;
    *p = 20;
    printf("*p = %d\ni = %d\nj = %d\n", *p, i, j);
}
****************************************************************/
/****************************************************************
//函数形参改变实参的值
void f(int * p){
    //不是定义了一个名字叫做*p的形参，而是定义了一个形参，该形参名字叫做p，它的类型是int *
    *p = 20;
}
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    
int main(void) {
    int i = 9;
    f(&i);
    printf("i = %d\n", i);
}
****************************************************************/
/***************************************************************
//指针变量只占4个字节
#include <stdio.h>
int main(void) {
    double arr[3] = {0.0, 0.0, 0.0};
    double *p;
    p = &arr[0];
    printf("%p\n", p);
    p = &arr[1];
    printf("%p\n", p);
}
****************************************************************/
//关于指针变量
// #include <stdio.h>
// void f();
// int main(void) {
//     int i;
//     int *p = &i;
//     printf("%p\n", p);
//     f(&p);
//     printf("%p\n", p);
// }

// void f(int ** q) {
//     *q = (int *)0x000000000065FE24;
// }


int main() {
    int i;
    int arr[10] = {0};
    
    for(i = 0; i < 10; i++) {
        printf("arr[%d] = %d\n", i, arr[i]);
    }
    return 0;
}